#Задача 1
# Объяви переменную age и присвой ей значение 25.
# Затем выведи на экран текст:
# Тебе 25 лет

age = 25
print(f"Тебе {age} лет")

# Задача 2
# Объяви переменную name и присвой ей значение 'Анна'.
# Затем выведи на экран фразу:
# Привет, Анна!

name = "Анна"
print(f"Привет, {name}!")

# Задача 3
# # Объяви переменную price и присвой ей значение 9.99.
# # Затем выведи на экран текст:
# # Цена товара: 9.99 руб.

price = 9.99
print(f"Цена товара: {price} руб.")

# Задача 4
# Объяви переменную is_student и присвой ей значение True.
# Затем выведи на экран текст:
# Вы студент: True

is_student = True
print(f"Вы студент: {is_student}")

# Задача 5
# Объяви переменную user_count и присвой ей значение 10.
# Затем увеличь её значение на 5 и выведи результат на экран в таком виде:
# Количество пользователей: 15

user_count = 10
user_count += 5
print(f"Количество пользователей: {user_count}")

# Задача 6
# Объяви переменную a и присвой ей значение 7.
# Затем выведи на экран:
# Результат: 14

a = 7
print(f"Результат: {a*2}")

# Задача 7
# Объяви переменную temperature и присвой ей значение 18.
# Затем выведи на экран текст:
# Температура: 18°C

temperature = 18
print(f"Температура: {temperature}°C")

#  Задача 8
# Объяви переменную x и присвой ей значение 5.
# Затем выведи на экран результат сравнения:
# x больше 3?
# Пример вывода:
# True
x = 5
print(x>3)

# Задача 9
# Объяви переменную name и присвой ей значение 'Мария'.
# Затем выведи на экран следующий текст:
# Привет, Мария!

name = "Мария"
print(f"Привет, {name}!")

# Задача 10
# Объяви переменную price и присвой ей значение 19.99.
# Затем выведи на экран текст:
# Стоимость: 19.99 руб.

price = 19.99
print(f"Стоимость: {price} руб.")

a = 3
b = "Тест"
